Merge branch 'dev' into feature-singlestore
